Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_i2c.c
/*****************************************************************************//**
 * @file    ht32f175x_275x_i2c.c
 * @version V1.0
 * @date    11/26/2010
 * @brief   This file provides all the I2C firmware functions.
 **********************************************************************************
 *
 * <h2><center>Copyright (C) 2011 Holtek Semiconductor Inc. All rights reserved</center></h2>
 *
 *********************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f175x_275x_i2c.h"
#include "ht32f175x_275x_ckcu.h"
#include "ht32f175x_275x_rstcu.h"

/** @addtogroup HT32F175x_275x_Peripheral_Driver HT32F175x/275x Peripheral Driver
  * @{
  */

/** @defgroup  I2C I2C
  * @brief I2C driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------------------------------------*/

/** @defgroup I2C_Private_TypesDefinitions  Definitions of I2C private types
  * @{
  */

/**
  * @}
  */

/* Private define ------------------------------------------------------------------------------------------*/

/** @defgroup I2C_Private_Define I2C private definitions
  * @{
  */

/* I2C ENI2C mask */
#define CR_ENI2C_SET             ((u32)0x00000008)
#define CR_ENI2C_RESET           ((u32)0xFFFFFFF7)

/* I2C ENGC mask */
#define CR_ENGC_SET              ((u32)0x00000004)
#define CR_ENGC_RESET            ((u32)0xFFFFFFFB)

/* I2C AA mask */
#define CR_ACK_SET               ((u32)0x00000001)
#define CR_ACK_RESET             ((u32)0xFFFFFFFE)

/* I2C PDMANACK mask */
#define CR_PDMANACK_SET          ((u32)0x00000400)
#define CR_PDMANACK_RESET        ((u32)0xFFFFFBFF)

/* I2C ENTOUT mask */
#define CR_ENTOUT_SET            ((u32)0x00001000)
#define CR_ENTOUT_RESET          ((u32)0xFFFFEFFF)

/**
  * @}
  */

/* Private macro -------------------------------------------------------------------------------------------*/

/** @defgroup I2C_Private_Macro I2C private macros
  * @{
  */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------------------------------------*/

/** @defgroup I2C_Private_Variable I2C private variables
  * @{
  */

/**
  * @}
  */

/* Private function prototypes -----------------------------------------------------------------------------*/

/** @defgroup I2C_Private_Function_Prototype I2C private function prototypes
  * @{
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/

/** @defgroup I2C_Private_Function I2C private functions
  * @{
  */

/*********************************************************************************************************//**
  * @brief  Deinitialize the I2C peripheral registers to their default reset values.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @retval None
  ***********************************************************************************************************/
void I2C_DeInit(I2C_TypeDef* I2Cx)
{
  /* Check the parameters */
  Assert_Param(IS_I2C(I2Cx));

  if(I2Cx == I2C0)
  {
    RSTCU_APBPerip0Reset(RSTCU_APBRST0_I2C0, ENABLE);
  }
  else
  {
    RSTCU_APBPerip0Reset(RSTCU_APBRST0_I2C1, ENABLE);
  }
}

/*********************************************************************************************************//**
  * @brief  Initialize the I2Cx peripheral according to the specified parameters in the I2C_InitStruct.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @param  I2C_InitStruct: pointer to a I2C_InitTypeDef structure that contains the configuration
  *   information for the specified I2C peripheral.
  * @retval None
  ***********************************************************************************************************/
void I2C_Init(I2C_TypeDef* I2Cx, I2C_InitTypeDef* I2C_InitStruct)
{
  u32 tmpreg;
  CKCU_ClocksTypeDef CKCU_ClockFreq;

  /* Check the parameters */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_GENERAL_CALL(I2C_InitStruct->I2C_GeneralCall));
  Assert_Param(IS_I2C_ACKNOWLEDGE_ADDRESS(I2C_InitStruct->I2C_AddressingMode));
  Assert_Param(IS_I2C_ACKNOWLEDGE(I2C_InitStruct->I2C_Acknowledge));
  Assert_Param(IS_I2C_ADDRESS(I2C_InitStruct->I2C_OwnAddress));
  Assert_Param(IS_I2C_SPEED(I2C_InitStruct->I2C_Speed));

  /* Enable I2Cx peripheral */
  I2C_Cmd(I2Cx, ENABLE);

  /*------------------------ I2Cx Control Register Configuration --------------------------------------------*/
  tmpreg = I2Cx->CR;
  tmpreg &= 0xFFFFFF7A;
  tmpreg |= I2C_InitStruct->I2C_GeneralCall | I2C_InitStruct->I2C_AddressingMode | I2C_InitStruct->I2C_Acknowledge;
  I2Cx->CR = tmpreg;

  /*------------------------ I2Cx Slave Address Register Configuration --------------------------------------*/
  I2Cx->ADDR = I2C_InitStruct->I2C_OwnAddress;

  /*------------------------ I2Cx SCL High & Low Period Generation Register Configuration -------------------*/
  CKCU_GetClocksFrequency(&CKCU_ClockFreq);
  I2Cx->SHPGR = (CKCU_ClockFreq.HCLK_Freq*9)/(I2C_InitStruct->I2C_Speed*20) - 9;
  I2Cx->SLPGR = (CKCU_ClockFreq.HCLK_Freq*11)/(I2C_InitStruct->I2C_Speed*20) - 9;
}

/*********************************************************************************************************//**
  * @brief  Fill each I2C_InitStruct member with its default value.
  * @param  I2C_InitStruct: pointer to an I2C_InitTypeDef structure which will be initialized.
  * @retval None
  ***********************************************************************************************************/
void I2C_StructInit(I2C_InitTypeDef* I2C_InitStruct)
{
  /* Initialize the I2C_GeneralCall member */
  I2C_InitStruct->I2C_GeneralCall = I2C_GENERALCALL_DISABLE;

  /* Initialize the I2C_AddressingMode member */
  I2C_InitStruct->I2C_AddressingMode = I2C_ADDRESSING_7BIT;

  /* Initialize the I2C_Acknowledge member */
  I2C_InitStruct->I2C_Acknowledge = I2C_ACK_DISABLE;

  /* Initialize the I2C_OwnAddress member */
  I2C_InitStruct->I2C_OwnAddress = 0;

